Repository: Vistaus/Secrets2
Catalog: po/*.po
Languages: es, ga, pt_br

source: Secrets
es: Secretos
ga: Rúin
pt_br: Segredos

source: Password Manager
es: Gestor de Contraseñas
ga: Bainisteoir Pasfhocal
pt_br: Gerenciador de Senhas

source: A clean interface for managing a pass repository
es: Una interfaz limpia para gestionar un repositorio pass
ga: Comhéadan glan chun stór pass a bhainistiú
pt_br: Uma interface limpa para gerenciar um repositório pass

source: Password;Manager;Security;GPG;Pass;
es: Contraseña;Gestor;Seguridad;GPG;Pass;
ga: Pasfhocal;Bainisteoir;Slándáil;GPG;Pass;
pt_br: Senha;Gerenciador;Segurança;GPG;Pass;

source: Add New Password
es: Añadir Nueva Contraseña
ga: Cuir Pasfhocal Nua Leis
pt_br: Adicionar Nova Senha

source: Pull changes
es: Obtener cambios
ga: Tarraing athruithe
pt_br: Puxar alterações

source: Push changes
es: Enviar cambios
ga: Brúigh athruithe
pt_br: Enviar alterações

source: Search passwords...
es: Buscar contraseñas...
ga: Cuardaigh pasfhocail...
pt_br: Buscar senhas...

source: Select an Item
es: Seleccionar un Elemento
ga: Roghnaigh Mír
pt_br: Selecione um Item

source: Select an item to view details.
es: Seleccione un elemento para ver los detalles.
ga: Roghnaigh mír chun sonraí a fheiceáil.
pt_br: Selecione um item para ver os detalhes.

source: Password Location
es: Ubicación de la Contraseña
ga: Suíomh an Phasfhocail
pt_br: Local da Senha

source: File path and location
es: Ruta y ubicación del archivo
ga: Conair agus suíomh an chomhaid
pt_br: Caminho e local do arquivo

source: Path
es: Ruta
ga: Conair
pt_br: Caminho

source: Password Details
es: Detalles de la Contraseña
ga: Sonraí an Phasfhocail
pt_br: Detalhes da Senha

source: Password
es: Contraseña
ga: Pasfhocal
pt_br: Senha

source: Show/Hide Password
es: Mostrar/Ocultar Contraseña
ga: Taispeáin/Folaigh Pasfhocal
pt_br: Mostrar/Ocultar Senha

source: Copy Password
es: Copiar Contraseña
ga: Cóipeáil Pasfhocal
pt_br: Copiar Senha

source: Username
es: Nombre de usuario
ga: Ainm úsáideora
pt_br: Nome de usuário

source: Copy Username
es: Copiar Nombre de Usuario
ga: Cóipeáil Ainm Úsáideora
pt_br: Copiar Nome de Usuário

source: Open URL
es: Abrir URL
ga: Oscail URL
pt_br: Abrir URL

source: Copy TOTP Code
es: Copiar Código TOTP
ga: Cóipeáil Cód TOTP
pt_br: Copiar Código TOTP

source: Recovery Codes
es: Códigos de Recuperación
ga: Cóid Aisghabhála
pt_br: Códigos de Recuperação

source: Backup codes for account recovery
es: Códigos de respaldo para la recuperación de la cuenta
ga: Cóid chúltaca le haghaidh aisghabháil cuntais
pt_br: Códigos de backup para recuperação de conta

source: Notes
es: Notas
ga: Nótaí
pt_br: Notas

source: Additional information
es: Información adicional
ga: Faisnéis bhreise
pt_br: Informações adicionais

source: Actions
es: Acciones
ga: Gníomhartha
pt_br: Ações

source: Manage this password entry
es: Gestionar esta entrada de contraseña
ga: Bainistigh an iontráil phasfhocail seo
pt_br: Gerenciar esta entrada de senha

source: _Edit
es: _Editar
ga: _Cuir in Eagar
pt_br: _Editar

source: _Remove
es: _Eliminar
ga: _Bain
pt_br: _Remover

source: _Preferences
es: _Preferencias
ga: _Sainroghanna
pt_br: _Preferências

source: _Keyboard Shortcuts
es: _Atajos de Teclado
ga: _Aicearraí Méarchláir
pt_br: _Atalhos de Teclado

source: _About Secrets
es: _Acerca de Secretos
ga: _Faoi Rúin
pt_br: _Sobre Segredos

source: _Import/Export
es: _Importar/Exportar
ga: _Iompórtáil/Easpórtáil
pt_br: _Importar/Exportar

source: _Generate Password
es: _Generar Contraseña
ga: _Gin Pasfhocal
pt_br: _Gerar Senha

source: _Quit
es: _Salir
ga: _Scoir
pt_br: _Sair

source: Choose folder and enter password name
es: Elija la carpeta e ingrese el nombre de la contraseña
ga: Roghnaigh fillteán agus cuir isteach ainm an phasfhocail
pt_br: Escolha a pasta e digite o nome da senha

source: Folder
es: Carpeta
ga: Fillteán
pt_br: Pasta

source: Select or type folder name
es: Seleccione o escriba el nombre de la carpeta
ga: Roghnaigh nó clóscríobh ainm an fhillteáin
pt_br: Selecione ou digite o nome da pasta

source: Password Name
es: Nombre de la Contraseña
ga: Ainm an Phasfhocail
pt_br: Nome da Senha

source: Generate Password
es: Generar Contraseña
ga: Gin Pasfhocal
pt_br: Gerar Senha

source: TOTP Secret (Base32)
es: Secreto TOTP (Base32)
ga: Rún TOTP (Base32)
pt_br: Segredo TOTP (Base32)

source: Add backup recovery codes
es: Añadir códigos de recuperación de respaldo
ga: Cuir cóid aisghabhála cúltaca leis
pt_br: Adicionar códigos de recuperação de backup

source: Add Recovery Code
es: Añadir Código de Recuperación
ga: Cuir Cód Aisghabhála Leis
pt_br: Adicionar Código de Recuperação

source: Additional information (optional)
es: Información adicional (opcional)
ga: Faisnéis bhreise (roghnach)
pt_br: Informações adicionais (opcional)

source: _Save
es: _Guardar
ga: _Sábháil
pt_br: _Salvar

source: Save new password entry
es: Guardar nueva entrada de contraseña
ga: Sábháil iontráil phasfhocail nua
pt_br: Salvar nova entrada de senha

source: Choose a password or folder from the sidebar to view its details
es: Elija una contraseña o carpeta de la barra lateral para ver sus detalles
ga: Roghnaigh pasfhocal nó fillteán ón mbarra taoibh chun a shonraí a fheiceáil
pt_br: Escolha uma senha ou pasta na barra lateral para ver seus detalhes

source: /folder/item
es: /carpeta/elemento
ga: /filltean/mir
pt_br: /pasta/item

source: user@example.com
es: usuario@ejemplo.com
ga: usáideoir@sampla.com
pt_br: usuario@exemplo.com

source: https://example.com
es: https://ejemplo.com
ga: https://sampla.com
pt_br: https://exemplo.com

source: Folders
es: Carpetas
ga: Fillteáin
pt_br: Pastas

source: Add Password
es: Añadir Contraseña
ga: Cuir Pasfhocal Leis
pt_br: Adicionar Senha

source: Add Folder
es: Añadir Carpeta
ga: Cuir Fillteán Leis
pt_br: Adicionar Pasta

source: Toggle Search
es: Alternar Búsqueda
ga: Scoránaigh Cuardach
pt_br: Alternar Pesquisa

source: GUI for pass password manager
es: GUI para el gestor de contraseñas pass
ga: GUI do bhainisteoir pasfhocal pass
pt_br: GUI para o gerenciador de senhas pass

source: Select a Password
es: Seleccionar una Contraseña
ga: Roghnaigh Pasfhocal
pt_br: Selecione uma Senha

source: Select a password to view details.
es: Seleccione una contraseña para ver los detalles.
ga: Roghnaigh pasfhocal chun sonraí a fheiceáil.
pt_br: Selecione uma senha para ver os detalhes.

source: Hidden
es: Oculto
ga: Folaithe
pt_br: Oculto

source: Two-Factor Authentication
es: Autenticación de Dos Factores
ga: Fíordheimhniú Dhá Fhachtóir
pt_br: Autenticação de Dois Fatores

source: Backup recovery codes
es: Códigos de recuperación de respaldo
ga: Cóid aisghabhála cúltaca
pt_br: Códigos de recuperação de backup

source: Secrets provides a user-friendly graphical interface for managing passwords stored with 'pass', the standard unix password manager.
es: Secretos proporciona una interfaz gráfica fácil de usar para gestionar contraseñas almacenadas con 'pass', el gestor de contraseñas estándar de Unix.
ga: Soláthraíonn Rúin comhéadan grafach atá éasca le húsáid chun pasfhocail a bhainistiú a stóráiltear le 'pass', an bainisteoir pasfhocal caighdeánach unix.
pt_br: O Segredos fornece uma interface gráfica amigável para gerenciar senhas armazenadas com 'pass', o gerenciador de senhas padrão do unix.

source: Key Features:
es: Características Principales:
ga: Príomhghnéithe:
pt_br: Principais Características:

source: Browse your password store in a tree view.
es: Navegue por su almacén de contraseñas en una vista de árbol.
ga: Brabhsáil do stór pasfhocal i radharc crainn.
pt_br: Navegue pelo seu cofre de senhas em uma visualização em árvore.

source: Copy passwords to the clipboard (cleared automatically after a timeout).
es: Copie las contraseñas al portapapeles (se borra automáticamente después de un tiempo de espera).
ga: Cóipeáil pasfhocail chuig an gearrthaisce (glantar go huathoibríoch tar éis am istigh).
pt_br: Copie senhas para a área de transferência (limpas automaticamente após um tempo).

source: Add new passwords and edit existing ones through a dialog.
es: Añada nuevas contraseñas y edite las existentes a través de un diálogo.
ga: Cuir pasfhocail nua leis agus cuir na cinn atá ann in eagar trí dialóg.
pt_br: Adicione novas senhas e edite as existentes através de uma caixa de diálogo.

source: Generate strong, random passwords.
es: Genere contraseñas fuertes y aleatorias.
ga: Gin pasfhocail láidre, randamacha.
pt_br: Gere senhas fortes e aleatórias.

source: Synchronize changes with a remote git repository (git pull/push).
es: Sincronice los cambios con un repositorio git remoto (git pull/push).
ga: Sioncronaigh athruithe le stór git iargúlta (git pull/push).
pt_br: Sincronize alterações com um repositório git remoto (git pull/push).

source: Main window showing password store
es: Ventana principal que muestra el almacén de contraseñas
ga: Príomhfhuinneog a thaispeánann stór pasfhocal
pt_br: Janela principal mostrando o cofre de senhas

source: Major update with enhanced UI and new features.
es: Actualización importante con interfaz de usuario mejorada y nuevas características.
ga: Nuashonrú mór le Chomhéadain feabhsaithe agus gnéithe nua.
pt_br: Grande atualização com interface aprimorada e novos recursos.

source: Complete UI redesign with Adw.NavigationSplitView
es: Rediseño completo de la interfaz de usuario con Adw.NavigationSplitView
ga: Athdhearadh iomlán ar an gComhéadain le Adw.NavigationSplitView
pt_br: Redesenho completo da interface com Adw.NavigationSplitView

source: Enhanced password management with structured fields
es: Gestión de contraseñas mejorada con campos estructurados
ga: Bainistíocht phasfhocal feabhsaithe le réimsí struchtúrtha
pt_br: Gerenciamento aprimorado de senhas com campos estruturados

source: TOTP (Time-based One-Time Password) support
es: Soporte para TOTP (Contraseña de un solo uso basada en tiempo)
ga: Tacaíocht do TOTP (Pasfhocal Aonuaire Bunaithe ar Am)
pt_br: Suporte a TOTP (Senha de Uso Único Baseada em Tempo)

source: Recovery codes management
es: Gestión de códigos de recuperación
ga: Bainistíocht cóid aisghabhála
pt_br: Gerenciamento de códigos de recuperação

source: Improved password generator with popover interface
es: Generador de contraseñas mejorado con interfaz emergente
ga: Gineadóir pasfhocal feabhsaithe le comhéadan aníos
pt_br: Gerador de senhas aprimorado com interface popover

source: Better folder management and organization
es: Mejor gestión y organización de carpetas
ga: Bainistíocht agus eagrú fillteán níos fearr
pt_br: Melhor gerenciamento e organização de pastas

source: Enhanced setup wizard with automatic dependency handling
es: Asistente de configuración mejorado con manejo automático de dependencias
ga: Treoraí cumraíochta feabhsaithe le láimhseáil spleáchais uathoibríoch
pt_br: Assistente de configuração aprimorado com tratamento automático de dependências

source: Improved error handling and user feedback
es: Manejo de errores y retroalimentación del usuario mejorados
ga: Láimhseáil earráidí agus aiseolas úsáideora feabhsaithe
pt_br: Melhor tratamento de erros e feedback do usuário

source: Initial release of Secrets Password Manager.
es: Lanzamiento inicial del Gestor de Contraseñas Secretos.
ga: Eisiúint tosaigh de Bhainisteoir Pasfhocal Rúin.
pt_br: Lançamento inicial do Gerenciador de Senhas Segredos.

source: Clean GTK4/Libadwaita interface
es: Interfaz limpia con GTK4/Libadwaita
ga: Comhéadan glan GTK4/Libadwaita
pt_br: Interface limpa com GTK4/Libadwaita

source: Full pass compatibility
es: Compatibilidad total con pass
ga: Comhoiriúnacht iomlán le pass
pt_br: Compatibilidade total com pass

source: Password generation and management
es: Generación y gestión de contraseñas
ga: Giniúint agus bainistíocht pasfhocal
pt_br: Geração e gerenciamento de senhas

source: Git synchronization support
es: Soporte para sincronización con Git
ga: Tacaíocht do shioncrónú Git
pt_br: Suporte à sincronização com Git

source: Automatic GPG setup wizard
es: Asistente de configuración automático de GPG
ga: Treoraí cumraíochta uathoibríoch GPG
pt_br: Assistente de configuração automático de GPG

source: password
es: contraseña
ga: pasfhocal
pt_br: senha

source: manager
es: gestor
ga: bainisteoir
pt_br: gerenciador

source: security
es: seguridad
ga: slándáil
pt_br: segurança

source: The 'pass' command was not found. Is it installed and in your PATH?
es: No se encontró el comando 'pass'. ¿Está instalado y en su PATH?
ga: Níor aimsíodh an t-ordú 'pass'. An bhfuil sé suiteáilte agus i do PATH?
pt_br: O comando 'pass' não foi encontrado. Ele está instalado e no seu PATH?

source: Password store is not initialized
es: El almacén de contraseñas no está inicializado
ga: Níl an stór pasfhocal tionscnaithe
pt_br: O cofre de senhas não foi inicializado

source: Invalid password path
es: Ruta de contraseña no válida
ga: Conair phasfhocail neamhbhailí
pt_br: Caminho de senha inválido

source: Password path cannot be empty
es: La ruta de la contraseña no puede estar vacía
ga: Ní féidir le conair an phasfhocail a bheith folamh
pt_br: O caminho da senha não pode estar vazio

source: Password content cannot be empty
es: El contenido de la contraseña no puede estar vacío
ga: Ní féidir le hábhar an phasfhocail a bheith folamh
pt_br: O conteúdo da senha não pode estar vazio

source: Password copied to clipboard
es: Contraseña copiada al portapapeles
ga: Cóipeáladh an pasfhocal chuig an gearrthaisce
pt_br: Senha copiada para a área de transferência

source: Username copied to clipboard
es: Nombre de usuario copiado al portapapeles
ga: Cóipeáladh an t-ainm úsáideora chuig an gearrthaisce
pt_br: Nome de usuário copiado para a área de transferência

source: Password entry deleted successfully
es: Entrada de contraseña eliminada con éxito
ga: Scriosadh an iontráil phasfhocail go rathúil
pt_br: Entrada de senha excluída com sucesso

source: Password entry saved successfully
es: Entrada de contraseña guardada con éxito
ga: Sábháladh an iontráil phasfhocail go rathúil
pt_br: Entrada de senha salva com sucesso

source: Password entry moved successfully
es: Entrada de contraseña movida con éxito
ga: Bogadh an iontráil phasfhocail go rathúil
pt_br: Entrada de senha movida com sucesso

source: Password store operation failed
es: Falló la operación del almacén de contraseñas
ga: Theip ar oibríocht an stóir phasfhocal
pt_br: A operação no cofre de senhas falhou

source: Interface error occurred
es: Ocurrió un error en la interfaz
ga: Tharla earráid comhéadain
pt_br: Ocorreu um erro de interface

source: Network operation failed
es: Falló la operación de red
ga: Theip ar oibríocht líonra
pt_br: A operação de rede falhou

source: File operation failed
es: Falló la operación de archivo
ga: Theip ar oibríocht comhaid
pt_br: A operação de arquivo falhou

source: Invalid input provided
es: Entrada proporcionada no válida
ga: Ionchur neamhbhailí curtha ar fáil
pt_br: Entrada fornecida inválida

source: Configuration error
es: Error de configuración
ga: Earráid chumraíochta
pt_br: Erro de configuração

source: An unexpected error occurred
es: Ocurrió un error inesperado
ga: Tharla earráid gan choinne
pt_br: Ocorreu um erro inesperado

source: An error occurred
es: Ocurrió un error
ga: Tharla earráid
pt_br: Ocorreu um erro
